app/controllers/consulta_controller.rb

SELECT * FROM `unidades` WHERE (`unidades`.`id` IN (6,44,33,22,11,12,7,23,45,34,8,46,35,24,13,47,36,9,25,14,15,48,26,37,38,16,27,50,49,1,40,17,28,39,51,41,2,30,29,18,52,42,19,3,31,20,32,54,10,4,43,21,5))
---
  def consulta_geral
  $tipo_con = 10
  @professor_rel_geral = Professor.find(:all, :order => 'pontuacao_final DESC', :include => 'unidade')