app/controllers/fichas_controller.rb

SELECT `fichas`.* FROM `fichas` WHERE (`fichas`.professor_id = 557)
---
  def index
    @fichas = @professor.fichas.find(:all)

SELECT * FROM `fichas` WHERE (`fichas`.`id` = 1 AND (`fichas`.professor_id = 1))
---
  def show
    @ficha = @professor.fichas.find(params[:id])

SELECT * FROM `professors` WHERE (`professors`.`id` = 557)
---
  def load_professors
    @professor = Professor.find(params[:professor_id], :include => :fichas)