app/controllers/professors_controller.rb

  def index
      if params[:search].blank?
        if current_user.regiao_id == 53 or current_user.regiao_id == 52 then
          @search = Professor.search(params[:search])
          @professors = @search.paginate(:all,:page=>params[:page],:per_page =>15, :include => 'unidade', :order => sort_column + " " + sort_direction)
        else
          @search = Professor.search(params[:search])
          @professors = @search.paginate(:page=>params[:page],:per_page =>15, :conditions => ['sede_id = ' + current_user.regiao_id.to_s + ' or sede_id = 54'], :order => sort_column + " " + sort_direction, :include => "unidade", :order => sort_column + " " + sort_direction)
---
SELECT * FROM `professors` WHERE (nome like '%Airton%')
SELECT * FROM `unidades` ORDER BY nome
SELECT * FROM `regiaos` ORDER BY nome

     $professor_mat = ''
     $professor_mat = params[:professor_professor_id]
     if !($professor_mat).nil? or !($professor_mat).empty? or !($professor_mat == '')
      if !(Professor.find_by_matricula($professor_mat)).nil? then
---
SELECT * FROM `professors` WHERE (`professors`.`matricula` = '6199') LIMIT 1

#|| Inicio Calculos de Tempo de Serviço  ||
# =======================================

    @acum = AcumTrab.find(:all, :conditions => ['professor_id = ' + $professor])
---
SELECT * FROM `acum_trabs` WHERE (professor_id = 1)

       $acum_dias_rede_ano = tot_dias.tot_acum_rede.to_i
       $acum_dias_unid_ano = tot_dias.tot_acum_unid.to_i
    end
     @dias_trab_anterior = Trabalhado.find(:all, :conditions => ['ano = ' + $data2.to_s + ' and professor_id= ' + $professor + ' and flag = 0 and ano_letivo = ' + $data.to_s])
---
SELECT * FROM `trabalhados` WHERE (ano = 2009 and professor_id= 1 and flag = 0 and ano_letivo = 2010)




    @professors = Professor.find(:all, :conditions => ['id=' + $professor ])
---
SELECT * FROM `professors` WHERE (`professors`.`id` = '1') LIMIT 1

  def gerar_ficha
    @ficha = Professor.find_by_matricula(params[:ficha])
    unless @ficha.nil?
      @existe = Trabalhado.find_all_by_professor_id(@ficha.id, :conditions => ['ano_letivo = ?',$data])
      @possui_ficha = Ficha.find_all_by_professor_id(@ficha.id,:conditions =>['ano_letivo = ?',$data])
      @contagem_finalizada = AcumTrab.find_all_by_professor_id(@ficha.id, :conditions => ['status = 1'])
      if @contagem_finalizada.present?
        if !@possui_ficha.present?
          if @existe.count == 2 then
            @fichas = Ficha.new
            @fichas.professor_id = @ficha.id
            @fichas.acum_trab_id = AcumTrab.find_by_professor_id(@ficha.id).id
            @fichas.trabalhado_anterior_id = Trabalhado.find_by_professor_id(@ficha.id, :conditions => ['ano_letivo = ? and ano = ?',$data, (($data.to_i) -1).to_s]).id
            @fichas.trabalhado_atual_id = Trabalhado.find_by_professor_id(@ficha.id, :conditions => ['ano_letivo = ? and ano = ?',$data, $data]).id
            @fichas.total_geral = Professor.find(@ficha.id).pontuacao_final
            @fichas.total_titulacao = Professor.find(@ficha.id).total_titulacao
            @fichas.total_trabalhado = Professor.find(@ficha.id).total_trabalhado
            @fichas.ano_letivo = $data
            @fichas.save
---
SELECT * FROM `professors` WHERE (`professors`.`matricula` IS NULL) LIMIT 1
SELECT * FROM `professors` WHERE (id = 108)
SELECT * FROM `trabalhados` WHERE (ano_letivo = '2010' and ano = '2009') AND (`trabalhados`.`professor_id` = 108) LIMIT 1
SELECT * FROM `acum_trabs` WHERE (`acum_trabs`.`professor_id` IS NULL) LIMIT 1
SELECT * FROM `professors` ORDER BY funcao
SELECT * FROM `professors` WHERE (`professors`.`id` = 108) LIMIT 1
INSERT INTO `fichas` (`total_titulacao`, `total_trabalhado`, `created_at`, `professor_id`, `acum_trab_id`, `updated_at`, `total_geral`, `ano_letivo`, `trabalhado_anterior_id`, `trabalhado_atual_id`) VALUES(1.0, 28.884, '2010-08-30 12:03:45', 108, 940, '2010-08-30 12:03:45', 29.884, NULL, 4299, 4300)

       acum_dias_unid_ano = tot_dias.tot_acum_unid.to_i
    end
     @dias_trab_anterior = Trabalhado.find(:all, :conditions => ['ano = ? and professor_id = ? and flag = 0 and ano_letivo = ?',$data2.to_s,@ficha.id,$data.to_s])
     if @dias_trab_anterior.empty?
---
SELECT * FROM `trabalhados`

  def status
    @unidade = Unidade.paginate(:all,:page=>params[:page],:per_page =>25)
    @status = AcumTrab.all(:joins =>:professor,:conditions => ['status = 0'], :order => 'professors.sede_id' )
---
SELECT * FROM `unidades` ORDER BY nome
SELECT * FROM `acum_trabs` WHERE (status = 0)
SELECT * FROM `professors` ORDER BY funcao

  def load_esmiucar
    @check_professor = Professor.all(:joins => [:acum_trab], :conditions => ["acum_trabs.status = 1"])
---
SELECT * FROM `acum_trabs` WHERE (`acum_trabs`.`professor_id` = 1) LIMIT 1
SELECT * FROM `professors` ORDER BY funcao

  def load_funcao
    @funcao = Professor.find(:all, :order => 'funcao')
---
SELECT * FROM `professors` WHERE (`professors`.`id` = 1) LIMIT 1

  def load_prof_titulos
    @prof_titulos = Titulacao.find(:all, :order => 'descricao')
---
SELECT * FROM `titulacaos` WHERE (`titulacaos`.`id` = 2) LIMIT 1

  def load_regiaos
    @regiaos = Regiao.find(:all, :order => "nome")
---
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` IN (22,6,7,8,1,2,3,4,5))

  def load_unidades
    @unidades = Unidade.find(:all, :order => "nome", :include => "regiao")
---
SELECT * FROM `unidades` WHERE (`unidades`.`id` IN (22,11,33,44,6,12,34,23,45,7,13,24,35,46,8,25,36,9,47,14,15,48,37,26,38,27,16,49,50,28,40,1,39,51,17,30,18,52,29,2,41,31,19,3,42,20,32,10,54,21,43,4,5))

  def load_trabalhados
    @trabalhados = Trabalhado.find(:all)
---
SELECT * FROM `trabalhados` WHERE (ano_letivo = '2010' and ano = '2009') AND (`trabalhados`.`professor_id` = 1) LIMIT 1