app/controllers/roles_users_controller.rb

SELECT * FROM `roles` WHERE (`roles`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def load_role
    @roles = Role.find(:all)
    @role_users = RolesUser.find(:all)