app/controllers/titulo_professors_controller.rb

SELECT * FROM `titulacaos` WHERE (`titulacaos`.`id` = 5) LIMIT 1
---
  def load_titulacao
    @titulacaos = Titulacao.find(:all)

SELECT * FROM `professors` WHERE (`professors`.`id` = 1009)
---
  def load_professors
    @professors = Professor.find(:all, :order => "matricula ASC")