app/controllers/trabalhados_controller.rb

    $teacher = params[:trabalhado_professor_id].to_i

    if !($teacher.nil?) or !($teacher == '') then
      if (Professor.find($teacher)).nil? then
---
SELECT * FROM `professors` WHERE (`professors`.`id` = 108) LIMIT 1

      else
        $teacher_id = $teacher
        $professor_id =  $teacher_id
        @acum = AcumTrab.find(:all, :conditions => ['professor_id = ' + ($teacher_id).to_s])
---
SELECT * FROM `acum_trabs` WHERE (professor_id = 108)

          $acum_dias_rede_ano = tot_dias.tot_acum_rede.to_i
          $acum_dias_unid_ano = tot_dias.tot_acum_unid.to_i
        end
        @dias_trab_anterior = Trabalhado.find(:all, :conditions => ['ano = ' + $data2.to_s + ' and professor_id= ' + ($teacher_id).to_s + ' and flag = 0'])
---
SELECT * FROM `trabalhados` WHERE (professor_id=108 and (flag = 1 ) and ano_letivo = 2010)

        $voltar = 1
        @inicial = AcumTrab.find(:all, :conditions => ['professor_id = ' + $teacher_id.to_s])
        @professores = Professor.find(:all,:conditions => ['id = ' + $teacher_id.to_s])
        if !@professores.empty? or !@professores.nil? then
---
SELECT * FROM `professors` ORDER BY matricula