app/controllers/unidades_controller.rb

  def load_regiaos
    @regiaos = Regiao.find(:all, :order => "nome")
---
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 2)

 def index
   if (params[:search].nil? || params[:search].empty?)
      @unidades = Unidade.paginate(:all,:page=>params[:page],:per_page =>20, :order =>  'nome ASC')
---
SELECT * FROM `unidades` ORDER BY nome ASC

  def show
    @unidade = Unidade.find(params[:id])
---
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 16)